---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithLips.MiddleBendLength
source: html/17a0da0f-fa1f-e0a6-1101-3bbfc8885eae.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithLips.MiddleBendLength Property

Middle Bend segment length.

## Syntax (C#)
```csharp
public double MiddleBendLength { get; set; }
```